package com.ict11.test;

public class Ex01 
{
	/* 문제1. 메소드의 선언부를 기술
	public static void main(String[] args) {}
	
	*2. boolean, char, byte, short, int, long, float, double
	*
	*3. int intVar = 129;
	*byte byteVar = (byte)intvar;
	*
	*4. a++ : 현재 변수 a가 가지고 있는 값을 사용한 후 나중에 a값이 증가
	*	++a : 현재 변수 a가 가지고 있는 값을 증가시킨후 나머지 계산
	*
	*5. 소수점 첫 째자리 까지 구하기
	*	double s1 = 36.666666;
	*	double k1 = (int)(s1*10)/10.0;
	*
	*6. 클래스는 멤버필드(변수,상수), 멤버메소드, 생성자
	*
	*7. 클래스를 객체로 생성할때 초기화목적으로 부르는 것은 생성자
	*
	*8. 어떤 클래스에서 같은 이름의 메소드가 여러개 존재하는것 오버로드, 오버로딩(중복정의)
	*
	*9. 상속관계에서 부모클래스의 메소드를 자식 클래스로 가지고와 상황에 맞게 변경하는것 오버라이딩(재정의)
	*
	*10. 추상 클래스 : 추상 메소드를 하나 이상 가지고 있는 클래스
	*	(추상 메소드 : body가 없는 메소드, 구체화가 되지 않은 메소드)
	*	 인터페이스 : 상수와 추상메소드로 이루진 클래스, 생성자가 없어서 객체 생성 못함
	*
	*11. Random클래스를 활용해서 정수 1-10 사이의 난수를 수하시오
	*Random random = new Random();
	*int k1 = random.nextInt(10)+1;
	*int k2 = (int)(random.nextDouble*10)+1;
	*
	*12. 제네닉 : 컬렉션이 이떤 객체들로 이루어 졌는데 표시하는 객체타입
	*	 컬렉션 : 객체를 모아서관리하는 인터페이스를 구현한것, 객체를 모라서 관리하는 자료구조
	*
	*13. 스레드 : start(), run()모두 있음
	*	 런어블 : run()만 있음, start()가 없으므로 다른 별도의 스레드를 생성해서 run()메소드를
	*			가진 클래스를 타겟으로 잡아야한다.
	*
	*14. 스레드에서 동기화 처리 : 임계영역에서 현재 실행중인 스레드가 순식간에 다른 스레드에게 제어권을 
	*						뺏기는 문제가 발생하는데 이를 해결하는 위한 방법
	*						해당 임게영역에 synchronized예약어를 사용하면 된다.
	*
	*15. 바이트 스트림 : 모든처리를 1byte, 영문자 대소문자, 숫자를 사용가능, 기계중심
	*				입력 : InputStream 출력 : OutputStream
	*	 문자 스트림 : 모든 처리를 2byte, 전 세계언러를 사용 가능
	*				입력 : Reader 출력 : Writer
	*
	*/
	
	
}
